[
  {
    "id": "book_001",
    "title": "The Legend of Qiwu's Martial Demon",
    "author": "Wang Ziqi",
    "type": "Cultivation",
    "chapters": [
      {
        "index": 1,
        "title": "The Mischievous Little Devil",
        "content": "In the Jianghu (martial world), there was a small sect called the 'Green Bamboo Gang'. With barely thirty disciples, it was insignificant in the grand scheme of the martial arts world. Yet, this tiny sect produced a 'Little Devil' who gave the entire region a headache—Wang Qiwu.\n\nWang Qiwu is eighteen this year, the only son of Old Man Wang, the leader of the Green Bamboo Gang. This kid never learned to behave; he was proficient in petty theft and brawling. However, he happened to practice martial arts quite well and had few rivals among his peers. Although the Green Bamboo Gang was small, Old Man Wang had been a figure of some repute in his youth. He only established this gang in the secluded foothills after tiring of the disputes of the Jianghu.\n\nWang Qiwu grew up in the Green Bamboo Gang. deeply influenced by his surroundings, he built a solid foundation in martial arts. However, by nature he was stubborn and mischievous, refusing to train seriously and always dreaming of making a name for himself in the Jianghu. Although Old Man Wang tried to discipline him many times, Wang Qiwu would feign obedience while continuing to do exactly as he pleased.\n\nOn this day, Wang Qiwu took a few of his 'brothers' to town to 'uphold justice'. In reality, they were going to collect protection fees. Seeing Wang Qiwu arrive, the small vendors in town were terrified and hurriedly closed their doors. Wang Qiwu walked down the street with a swagger, followed by his lackeys, all looking arrogant.\n\n'Brother Qiwu, it's time to collect this month's fees,' a lackey reminded him.\n\n'I know,' Wang Qiwu nodded. 'The usual rules. Start from the East Street.'\n\nThey arrived at a tofu stall run by an honest old man. Seeing Wang Qiwu, the old man hurriedly took out ten copper coins and handed them over, trembling. 'Brother Qiwu, this is this month's fee.'\n\nWang Qiwu took the money and patted the old man on the shoulder. 'Not bad, you're sensible. If anyone bullies you in the future, just mention my name, Wang Qiwu.'\n\n'Yes, yes, yes,' the old man nodded repeatedly, suffering in silence.\n\nAfter a round, Wang Qiwu had collected over fifty coins. He said triumphantly to his brothers: 'See? This is the Jianghu. Whoever has the hardest fist makes the rules. Our Green Bamboo Gang may be small, but in this town, we are the bosses.'\n\n'Brother Qiwu is mighty!' the lackeys shouted in unison.\n\nJust then, a middle-aged man in black suddenly appeared behind Wang Qiwu, his eyes cold as knives. 'Wang Qiwu of the Green Bamboo Gang? I hear you can fight?'\n\nWang Qiwu looked back and was startled. This man in black exuded a powerful killing aura; he was clearly no ordinary person. But on the surface, Qiwu pretended to be fearless. 'That's me. What about it?'\n\n'Nothing much, I just want to spar with you,' the man in black said lightly.\n\n'Fine,' Wang Qiwu agreed. Although he was a bit scared, he couldn't back down in front of so many people.\n\nThe two took their stances. Wang Qiwu struck first, punching toward the man's face. But the man in black simply raised his hand and caught Wang Qiwu's fist. Qiwu tried to break free, but found the opponent's hand was like an iron clamp.\n\n'Kid, your kung fu is okay, but you are far from ready,' the man in black said. With a gentle push, Wang Qiwu stumbled back a dozen steps, nearly falling.\n\nUnconvinced, Wang Qiwu charged again. But no matter how he attacked, the man in black easily neutralized it. After a dozen rounds, Wang Qiwu was panting heavily, while the man in black remained calm and composed.\n\n'That's enough for today,' the man in black suddenly stopped. 'Kid, your martial arts are decent, but you have a long way to go. Today was just a lesson. Don't be so arrogant in the future.'\n\nAfter speaking, the man turned and left, quickly vanishing into the crowd.\n\nWang Qiwu stood there with mixed feelings. This was the first time he had met a true expert, and the first time he had been beaten so thoroughly. But instead of being discouraged, he became more determined to make a name for himself in the Jianghu.\n\n'Brother Qiwu, are you okay?' the lackeys gathered around.\n\n'I'm fine,' Wang Qiwu waved his hand. 'Let's go back. No one is allowed to speak of what happened today.'\n\nBack at the Green Bamboo Gang, Wang Qiwu locked himself in his room and began to train seriously. He knew that to survive in the Jianghu, petty tricks weren't enough; he needed real skill. But what Wang Qiwu didn't know was that a greater storm was quietly brewing. The appearance of the man in black was just the beginning."
      },
      {
        "index": 2,
        "title": "The Calamity of Extermination",
        "content": "Late at night three days later, under a dark moon and high winds, the Green Bamboo Gang was suddenly surrounded by a group of men in black. These men possessed high martial arts skills and moved like ghosts, silently infiltrating the compound.\n\n'Who goes there?' the disciple on night watch noticed something wrong and shouted. But his voice was quickly replaced by a scream.\n\nDozens of men in black rushed into the Green Bamboo Gang like phantoms, killing anyone they saw. Although the disciples resisted bravely, they were no match for these assassins. Screams, the sounds of fighting, and the clash of weapons rose and fell; the Green Bamboo Gang instantly turned into a living hell.\n\n'Father!' Hearing the fighting outside, Wang Qiwu rushed out of his room. The courtyard was already littered with corpses—all disciples of the gang. Old Man Wang was fighting fiercely with a man in black. Although Old Man Wang's skills were good, he was clearly at a disadvantage.\n\n'Qiwu, run!' Old Man Wang shouted when he saw his son. 'Run! Leave a survivor for our Green Bamboo Gang! You can't deal with these people!'\n\n'No, I won't go!' Wang Qiwu's eyes were red. 'I want to fight with you!'\n\n'Stupid child!' Old Man Wang was frantic. 'Staying here means death. Go quickly! survive and avenge us!'\n\nJust then, a man in black ambushed Old Man Wang from behind, stabbing him through the chest. Old Man Wang's body shook, and blood flowed from the corner of his mouth. 'Qiwu... run... remember... revenge...' Old Man Wang shouted with his last ounce of strength, then collapsed to the ground.\n\n'Father!' Wang Qiwu's eyes nearly split with rage. He wanted to rush over, but was blocked by several men in black. He knew this was not the time to be impulsive. He had to live to avenge the Green Bamboo Gang.\n\nWang Qiwu gritted his teeth, turned, and ran. Several men in black wanted to chase, but were stopped by others. 'No need to chase,' said one who looked like the leader. 'A brat like that can't make any waves. Our mission is complete.'\n\nWang Qiwu ran wildly until he was more than ten miles away before daring to stop. He looked back in the direction of the Green Bamboo Gang and saw flames soaring into the sky; the entire place had been reduced to ashes.\n\n'Father... brothers...' Wang Qiwu knelt on the ground, tears streaming down his face. He grew up in the Green Bamboo Gang. Although he was usually naughty, this was his home. Now, his home was gone, his family was gone, everything was destroyed.\n\n'Who is it? Who did this?' Wang Qiwu clenched his fists until his nails dug into his flesh. 'I will find the murderer and avenge you!'\n\nWang Qiwu hid in the mountains for a night. At dawn the next day, he secretly returned to the ruins. There was nothing left but scorched earth and charred bodies. The air was filled with the sickening smell of burning.\n\nWang Qiwu searched the ruins for a long time and finally found Old Man Wang's legacy—a rusty short sword. This was the weapon Old Man Wang used when he was young. Although it hadn't been used for a long time, Wang Qiwu knew it was the only memento his father left him.\n\n'Father, rest assured.' Wang Qiwu held the short sword, his eyes shining with determination. 'I will definitely avenge you and the brothers! No matter who the enemy is, no matter how powerful, I will make them pay in blood!'\n\nWang Qiwu kowtowed three times before the ruins, then turned and left. He knew that from today on, his life would change completely. He was no longer the carefree 'Little Devil', but an avenger bearing a sea of blood. He had to become stronger, find those men in black, and seek justice. But Wang Qiwu didn't know that the men in black hadn't let him go. They were searching for his whereabouts, preparing to pull up the weeds by the roots. A hunt was about to begin."
      },
      {
        "index": 3,
        "title": "The Road to Revenge",
        "content": "After leaving the Green Bamboo Gang, Wang Qiwu began his road to revenge. He asked around about the men in black, but they seemed mysterious, and few knew their true identity.\n\n'Have you seen a group of men in black?' Wang Qiwu asked an innkeeper.\n\n'A group of men in black did pass by a few days ago, heading east,' the boss thought for a moment. 'But young man, I advise you not to provoke them. Those people didn't look kind; it's dangerous for you to go alone.'\n\n'Thank you for your kindness,' Wang Qiwu said. 'But I must find them.'\n\nWang Qiwu traveled east, asking for news everywhere he went. He passed through countless towns and asked countless people, but found few clues. The men in black were like ghosts, coming and going without a trace.\n\nOne day, Wang Qiwu came to a small town. He heard there was a martial arts expert here who might know something. He found the expert's residence, only to find it empty. 'Too late,' Wang Qiwu thought to himself.\n\nJust then, he heard footsteps behind him. Turning around, he saw several men in black walking toward him. These men had cold eyes and radiated killing intent.\n\n'Found you, kid,' one man said coldly. 'I didn't expect your luck to be so good, escaping us before.'\n\n'It's you! You destroyed the Green Bamboo Gang!' Wang Qiwu's eyes turned red. 'I want to avenge everyone!'\n\n'Revenge?' The man sneered. 'With just you? Kid, you are too naive. In this Jianghu, the strong eat the weak. Your gang was too weak; it deserved to be wiped out.'\n\n'You!' Wang Qiwu trembled with anger, but he knew he couldn't be impulsive. Facing so many experts, he had no chance of winning.\n\nThe men in black attacked simultaneously. Although Wang Qiwu's skills were good, he quickly fell to a disadvantage. He fought with all his might, finally found an opening, and turned to run.\n\n'Chase him!' The leader shouted, and the group followed closely.\n\nWang Qiwu was familiar with the terrain here and soon shook them off. He hid in a cave, gasping for breath. He knew his current strength was far from enough. To get revenge, he had to become stronger.\n\nFrom that day on, Wang Qiwu began training even more bitterly. He practiced from dawn until late at night. Although exhausted, he never gave up. At the same time, he continued to search for the whereabouts of the men in black.\n\nOne day, Wang Qiwu heard about a nearby Martial Arts Assembly where many experts would gather. He felt this was a good opportunity to gather intelligence.\n\nAt the assembly, seeing the sea of people, he asked around and finally got a clue from an old traveler. 'Those men in black?' The old traveler thought. 'I seem to have heard of them. They are an organization called the 'Shadow Sect', specializing in shady missions.'\n\n'Shadow Sect?' Wang Qiwu's heart skipped a beat. 'Do you know where they are?'\n\n'I don't know that,' the traveler shook his head. 'The Shadow Sect is very mysterious. However, I heard their sect leader is a formidable figure with unfathomable kung fu.'\n\n'Thank you,' Wang Qiwu said. 'I will find them.'\n\nThe Shadow Sect's pursuit grew tighter, and Wang Qiwu was fleeing almost every day. One day, he hid in a ruined temple. Just as he was about to rest, he heard footsteps outside.\n\n'Come out, kid. We know you're in there.' A cold voice came from outside.\n\nWang Qiwu walked out to see a dozen expert killers. 'Attack!' the leader commanded.\n\nWang Qiwu resisted with all his might but was soon seriously injured and on the verge of collapse. 'Am I really going to die here today?' he thought in despair.\n\nSuddenly, a long howl came from the distance. A white-haired old man rushed over like lightning, knocking down several men in black instantly.\n\n'Seeing injustice, I draw my sword to help,' the old man said lightly. 'You Shadow Sect people do much evil. Today I will act on behalf of Heaven and destroy you.'\n\nIn less than the time it takes to burn an incense stick, all the killers were defeated. The leader tried to flee but was struck down by the old man.\n\n'Thank you, Senior, for saving my life.' Wang Qiwu struggled to stand and bowed.\n\n'No need,' the old man waved his hand. 'I see you are a good seedling and didn't want you to die. However, your current strength is too weak. You are far from ready for revenge. I can give you some pointers.'\n\nFrom that day on, Wang Qiwu studied under the old man. The martial arts taught were profound and difficult, but Qiwu studied earnestly. However, good times don't last long. The Shadow Sect soon found them, and this time the Sect Leader came personally.\n\n'Kid, run. Leave this to me. Remember, live on, become strong, and then come back for revenge!'\n\nWang Qiwu gritted his teeth and ran. Hearing the fierce fighting behind him, he knew the old man was likely doomed. But he couldn't give up. He had to live, become strong, and take revenge!"
      },
      {
        "index": 4,
        "title": "The Supreme Martial Art",
        "content": "Wang Qiwu continued forward in despair. He didn't know where to go or what to do. He could only walk aimlessly, hoping to find a glimmer of hope.\n\nOne day, he arrived at a desolate valley. It was uninhabited, full of weeds and rocks. Hungry and tired, Wang Qiwu found a cave to rest.\n\nJust as he was about to start a fire, he noticed something glowing deep in the cave. Curious, he walked over and saw strange characters and patterns carved on the stone wall. They looked ancient, as if they had existed for a very long time.\n\n'What is this?' Wang Qiwu looked closely and realized it seemed to be a martial arts manual. Although he hadn't read many books, he had learned martial arts from Old Man Wang and knew a bit about manuals.\n\nHe studied the carvings carefully and discovered it was a profound martial art. The cultivation method was unique, requiring the circulation of 'Qi' (internal energy) through specific routes to transform it into power.\n\n'Is this a legendary Supreme Martial Art?' Wang Qiwu thought excitedly. He read on and found it was called the 'Hunyuan Art' (Primordial Chaos Art). It was said that at the highest level, one could split mountains and crack rocks.\n\nWang Qiwu felt as if he had found a treasure and immediately began to cultivate. Although it was difficult, he practiced day and night, forgetting to eat or sleep. A month later, he finally mastered the basics. He felt his strength leap forward, his internal energy several times stronger than before. He tried striking with his palm, and with a 'boom', he left a palm print on the stone wall.\n\n'Great!' Wang Qiwu thought. 'With this, I can finally take revenge!'\n\nBut he knew he needed combat experience. He left the valley to test his skills against the Shadow Sect. However, just as he walked out, he encountered bandits.\n\n'Kid, hand over your money!' a bandit said fiercely.\n\n'I have no money,' Wang Qiwu said lightly.\n\n'No money?' The bandit sneered. 'Then leave your life!'\n\nThe bandits attacked. Wang Qiwu calmly circulated his Hunyuan Art and struck with his palm. With a boom, the bandits were sent flying, unable to get up.\n\n'How... how is this possible?' a bandit asked in terror.\n\n'Now you know fear?' Wang Qiwu said coldly. 'Too late.'\n\nHe didn't kill them, but crippled their martial arts before leaving. He knew he was ready.\n\nHowever, news of him learning the Hunyuan Art leaked. Martial artists coveted the technique and came to snatch it. One day, while resting at an inn, Wang Qiwu was surrounded.\n\n'Wang Qiwu, hand over the manual, and we might leave your corpse intact,' the leader said.\n\n'I have no manual,' Wang Qiwu said. 'I memorized it from a stone wall.'\n\n'Then hand over your head!' The leader roared. 'Attack!'\n\nThe mob attacked. Wang Qiwu fought them with the Hunyuan Art. Although they were skilled, his power was superior. Every palm carried immense Qi, forcing them back.\n\n'How is your kung fu so strong?' the leader gasped.\n\n'This is the power of the Hunyuan Art,' Wang Qiwu said. 'Now, it's your turn.'\n\nHe knocked them all down. 'Tell me, how did you know about the art?' he asked coldly.\n\n'The... Shadow Sect told us,' the leader trembled. 'They said if we killed you and got the manual, they'd pay us a fortune.'\n\n'Shadow Sect?' A murderous look flashed in Wang Qiwu's eyes. 'They really linger like ghosts. But that's fine. It's time I went to settle the score.'"
      },
      {
        "index": 5,
        "title": "A Crushing Defeat",
        "content": "Wang Qiwu decided to take the initiative and attack the Shadow Sect. He found out their headquarters was at 'Black Wind Mountain' and set off immediately.\n\nAfter days of trekking, he arrived. Black Wind Mountain was steep and dangerous, surrounded by clouds and mist. 'Shadow Sect, I am here,' Wang Qiwu looked at the mountain gate with hatred.\n\nHe struck the gate with his Hunyuan Art, shattering it with a loud boom. Disciples of the sect rushed out.\n\n'Who goes there?'\n\n'Wang Qiwu,' he said coldly. 'I am here for revenge.'\n\n'It's you?' A disciple recognized him. 'You dare come here? You seek death!'\n\n'Cut the crap!' Wang Qiwu roared. 'Tell your Sect Leader to come out!'\n\nThe disciples attacked, but Wang Qiwu defeated them easily with his powerful internal energy.\n\n'Sect Leader, come out!' Wang Qiwu shouted.\n\n'Big words.' A cold voice came from within. The Shadow Sect Leader walked out. He was a tall man in his forties with eyes like a hawk.\n\n'You are the leader? You ordered the destruction of the Green Bamboo Gang?'\n\n'Correct,' the Leader nodded. 'I am curious how you survived.'\n\n'Today, I will avenge them!' Wang Qiwu shouted.\n\n'With just you?' The Leader sneered. 'Let's see how strong your Hunyuan Art really is.'\n\nThey fought. Wang Qiwu struck with his full power, but the Leader matched him palm for palm. Wang Qiwu felt his arm go numb. 'So strong!'\n\n'Not bad,' the Leader said. 'But still far off.'\n\nThe Leader attacked aggressively. His martial arts were terrifyingly high. Wang Qiwu fought desperately but was soon overwhelmed. After hundreds of rounds, the Leader struck Wang Qiwu in the chest. He vomited blood and fell.\n\n'You lose, kid,' the Leader said. 'Now, die.'\n\nJust as the Leader struck to kill, a figure rushed in like lightning to block the blow. 'It's me,' a familiar voice said. 'Old thing, we meet again.'\n\nIt was the old man who had saved him before! He looked injured but his eyes were sharp.\n\n'Senior...' Wang Qiwu was emotional.\n\n'Don't talk. Run!' the old man roared. 'Live on! One day you will be strong enough!'\n\nWang Qiwu gritted his teeth. He knew staying would only be a burden. 'Senior, take care!' He turned and fled.\n\nBehind him, the sounds of battle raged. Wang Qiwu ran until he couldn't run anymore, then fell to his knees crying. He knew the old man was likely dead.\n\n'Why? Why am I always so weak?' Wang Qiwu clenched his fists. 'Why can't I protect anyone?' He fell into deep despair, but he knew he had to live."
      },
      {
        "index": 6,
        "title": "A New Beginning",
        "content": "After his defeat, Wang Qiwu began running again. He arrived at a remote, unknown small town and decided to settle there temporarily.\n\nPenniless, he needed work. He saw an old man selling beef offal (organ meat) by the street. The old man looked kind.\n\n'Young man, do you want to buy beef offal?'\n\n'I... I have no money,' Wang Qiwu said. 'But I can work for you.'\n\n'What can you do?'\n\n'I know martial arts. I can protect the stall.'\n\n'Martial arts?' The old man laughed. 'This is a small town, not the Jianghu. We don't need that. But if you want, you can help me cut the beef.'\n\nWang Qiwu picked up the knife. His hand was steady, and he cut the meat with martial precision. The old man was impressed and hired him.\n\nFrom then on, Wang Qiwu worked at the stall. Cutting meat, serving customers. It was tiring but fulfilling. He realized this peaceful life wasn't bad. No danger, no killing.\n\n'Young man, you have killing intent on you,' the old man said one day. 'You are from the Jianghu.'\n\n'You... how do you know?'\n\n'I used to be in the Jianghu too,' the old man smiled. 'Since you chose this place, live well. Let the past go.'\n\n'I want to, but I have revenge to take,' Wang Qiwu said.\n\n'Revenge won't bring the dead back,' the old man sighed. 'Your family would want you to live happily, not in pain.'\n\nWang Qiwu fell into thought. Three years passed. He traveled the Jianghu again, experienced life and death, and finally understood the old man's words. Revenge isn't everything.\n\nHe returned to the town. 'Old man, I'm back. I want to sell beef offal with you.'\n\n'You figured it out?'\n\n'Yes. I like this peaceful life.'\n\nWang Qiwu settled down. His knife skills became famous in the town. 'Your hand is so steady,' customers would praise.\n\n'It's because I used to practice martial arts,' he would smile.\n\nYears later, he took over the stall. He looked at the bustling crowd and felt satisfied. This was the life he chose."
      },
      {
        "index": 7,
        "title": "The Shadow Reappears",
        "content": "One day, while working, Wang Qiwu saw a familiar figure. It was a woman with an extraordinary temperament.\n\n'Qiwu? Is it really you?'\n\n'Xiaoyue?' It was his childhood friend and crush from the village near the Green Bamboo Gang.\n\n'I heard the gang was...' she stopped, looking at him with pity. 'You're selling beef offal?'\n\n'The past is the past,' Wang Qiwu smiled bitterly.\n\n'I opened a small shop nearby,' she said. 'Come visit.'\n\nThe peace didn't last long. The Shadow Sect found him again. Men in black appeared in town asking for a man with good martial arts.\n\n'Old man, I have to go,' Wang Qiwu said. 'I can't implicate the town.'\n\n'Where will you go?'\n\n'I don't know.'\n\nBut then, Wang Qiwu stopped. 'No. I won't run. I've been running too long. I will stay and end this.'\n\nHe confronted the men in black. 'I am Wang Qiwu.'\n\n'Good. Die!'\n\nThis time, Wang Qiwu didn't hold back. His Hunyuan Art had matured. He defeated the assassins. But he knew this was just the start. He decided to go back to Black Wind Mountain one last time."
      },
      {
        "index": 8,
        "title": "The Final Battle",
        "content": "Wang Qiwu returned to Black Wind Mountain. It was eerily quiet. The headquarters was empty.\n\nHe found a secret room and a journal. He discovered the truth: The Green Bamboo Gang was destroyed because they accidentally learned a secret that could affect the safety of the entire martial world. The Shadow Sect killed them to silence them.\n\n'For a secret... you killed everyone?' Wang Qiwu trembled with rage.\n\nThe Shadow Sect Leader appeared behind him with a group of men. 'You finally came.'\n\n'You destroyed my home for a secret?'\n\n'The weak deserve to die,' the Leader said coldly.\n\nThey fought again. This time, Wang Qiwu's Hunyuan Art was at perfection. But the Leader was still terrifyingly strong. Wang Qiwu began to lose ground.\n\n'I cannot lose!' Wang Qiwu remembered the old man's teachings. He decided to use a forbidden technique—one that would consume all his energy and potentially kill him.\n\n'Die together!' Wang Qiwu roared, gathering all his Qi into one palm strike.\n\nBOOM! The Shadow Sect Leader was hit squarely and collapsed, coughing blood. 'I... lost... But you will die too... that move...' he gasped and died.\n\nWang Qiwu collapsed, his energy drained. He dragged his broken body down the mountain.\n\nDays later, he returned to the small town, barely alive. 'Qiwu!' the old man cried.\n\n'It's over,' Wang Qiwu whispered. 'The Shadow Sect is gone.'\n\nHe survived. He went back to the stall. He chopped meat, served customers, and lived a simple life. He was no longer the Little Devil, nor the Avenger. He was just Wang Qiwu, a man who found his own peace.\n\nThis is the story of 'The Legend of Qiwu'. A story of growth, revenge, and finding oneself. True happiness is not in being the strongest, but in living the life you want."
      }
    ],
    "readChapters": 0
  },
  {
    "id": "book_002",
    "title": "Chronicles of Mountains and Seas",
    "author": "Nan Yan",
    "type": "Fantasy",
    "chapters": [],
    "readChapters": 0
  },
  {
    "id": "book_003",
    "title": "Notes of a Nightwalker",
    "author": "Lu Li",
    "type": "Suspense",
    "chapters": [],
    "readChapters": 0
  }
]